---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySunAndShadowSettings
source: html/5ca1b4b1-a140-df5e-579d-839e57ba729c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySunAndShadowSettings Property

SunAndShadowSettings cannot be copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopySunAndShadowSettings { get; }
```